# KeyBasedTreeEntriesLoadResults Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
KeyBasedTreeEntriesLoadResults Properties
KeyBasedTreeEntriesLoadResults Class See Also
---
The KeyBasedTreeEntriesLoadResults type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
KeyBasedTreeEntriesLoadResults Class
Autodesk.Revit.DB Namespace